"use strist";

// alert("hello");
// const result = confirm("How are you?");

// console.log(result);
// const answer = prompt("Вам есть 18 лет?", "18");
// console.log(typeof(answer) );

// Вся информация, которая приходит от пользователя приходит в виде строк, независимо цифры пишутся или буквы

// чтобы изменить тип данных от пользователя из строки в число, нужно поставить знак + перед prompt
// const names = prompt("Как вас зовут?");
// const age = prompt("Сколько вам лет?");
// const answers = [];

// answers[0] = names;
// answers[1] = age;

console.log(typeof(answers));


const category = "boys";
console.log(`https//wayy.asdas/${category}/"cold"`);

// Существуют специальные кавычки `Бэктики` с их помощью можно более удобно записывать инфу например:
// const nik = "igor";
// alert(`solution,${nik}`);


// Операторы

// Унарный "+" ставится перед строкой, для того чтобы превратить ее в число. Может использоваться к примеру в заполнении формы пользователем

let incr =  10,
    dicr = 10;

// incr++ - инкримент "++"  увеличивает значение переменной на 1
// dicr-- - уменьшает значение переменной на 1
// Префиксная - когда incr++ В начале задается старое значение 10 , потом если цикл повторяется начинает прибавляться.
// Посфиксная - когда ++incr сразу прибаваляет к значению единицу

// console.log(--incr);
// console.log(++dicr);

// % - Возвращает остаток от деления
// 5%2 = 1

// Оператор "=" - называется присваивание. Т.е. если я хочу присвоить значение 10 переменно score я пишу score (присвоить)= 10

// Оператор "==" - называется сравнение. пример: 4*2 == 8

// Оператор "===" - называется строгое сравнение. пример 4*2 === "8" не будет равно. т.к. сравниваются еще и типы данных;

// Оператор "&&" - и возвращает правду только если обе переменных true

// Оператор "││" - или возвращает правду если хоть одна переменная является правдой.

// Оператор "!" - является отрицанием. Изменяет значение переменой в обратную сторону если был false в true,  если был + в -

let first = true,
    second = false;

    console.log(!first || second);


// Оператор "!=" не является
// Оператор "!==" не равно численно;
// Оператор "!===" не равно численно  и по типу;


// Git Hub


cd - чтобы указать путь к папке

git init - инициируй нам путь